#include <bits/stdc++.h>
using namespace std;
int main()
{
    /*
    আমরা দেখবো কিভাবে vector initialization করে

    ১. আমরা যদি vector তৈরি করতে চাই তাহলে আমাদের আগে vector লিখতে হবে <> angle brackets এর মধ্যে আমরা কি
    ধরনের data type এর vector তৈরি করতে চাচ্ছি সেটা বলতে হবে তার পর আমাদের একটি নাম যেমন v1 দিতে হবে যেটা আমরা
    উদাহারন ১ঃ এর মধ্যে দেখতে পাচ্ছি.




    ২. আমরা যদি dynamic ভাবে সাইজ দিতে চাই তাহলে নামের পরে first brackets দিয়ে সেখানে size দিলে হবে যা আমরা
    উদাহারন ২ঃ দেখতে পাচ্ছি.



    ৩. আমরা যদি সাইজ বলে দেয়ার সাথে প্রাথমিক value সেট করতে চাই তাহলে আমাদের (5,10) এর মানে হল আমাদের ৫ সাইজ এর
    একটি vecotor তৈরি হবে এবং যার প্রতিটির value ১০ থাকবে যা আমরা উদাহারন ৩ঃ দেখতে পাচ্ছি .



    ৪. আমরা যদি একটি vector এর value গুলো অন্য vector এর মধ্যে কপি করতে চাই তাহলে যেই vector এর মান কপি করতে চাই
    সেই vector নতুন vector এর মধ্যে দিয়ে দিতে হবে যেমনটা আমরা উদাহারন ৪ঃ দেখতে পাচ্ছি .



    ৫. আমরা যদি কোন একটি array কপি করতে চাই তাহলে first brackets মধ্যে array name কমা array name + size যা আমরা
    উদাহারন ৫ঃ দেখতে পাচ্ছি .
    

     */

    // উদাহারন ১ঃ
    vector<int> v1;

    // উদাহারন ২ঃ
    vector<int> v2(5);

    // উদাহারন ৩ঃ
    vector<int> v3(5, 10);

    // উদাহারন ৪ঃ
    vector<int> v4(5, 10);
    vector<int> v5(v4);

    // উদাহারন ৫ঃ
    int arr[5] = {10, 20, 30, 40, 50};
    vector<int> v6(arr, arr + 5);
    return 0;
}