#include <bits/stdc++.h>
using namespace std;
int main()
{
    /*
    আমরা এখানে জানার চেষ্টা করবো O(N*log(N)) complexity নিয়ে ।
    প্রথমে আমরা যেই বিষয়টি দেখতে পাচ্ছি N*log(N) আমরা যদি এই বিষয়টি ২ভাগে ভাগ করি তাহলে আমরা যেই বিষয়টি বুজতে পারি
    সেটা হল যখনি আমাদের N অন্য গুণ আকারে থাকে তখন বুজতে হবে আমাদের লুপের পেটের বিতরে অন্য লুপ থাকবে এখন কথা হল
    কি লুপ থাকবে সেটা হল log(n) লুপ থাকবে O(n*log(n)) এর max value 10^5

    log(n) লুপ বলতে আমরা বুজি যখন N এর value প্রতিবার গুণ আকারে আগাতে থাকে অথাবা N এর value প্রতিবার ভাগ হতে থাকে
    তার মানে বিষয়টি এমন দারাই আমাদের N তম একটি লুপ চলবে যার পেটের বিতরে log(n) চলবে ।

     */

    int n;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j = j * 2)
        {
        }
    }


    // এই প্রোগ্রামের time complexity হল O(n*log(n))

    return 0;
}